# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here

temp = pd.read_csv('/Users/gracemartinez/ironhack/Temp_states.csv')

#### Print `temp`.

In [3]:
# your code here

temp.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [13]:
# your code here

temp.describe(include= 'all')

          City     State  Temperature
count        7         7     7.000000
unique       7         3          NaN
top     Newark  New York          NaN
freq         1         3          NaN
mean       NaN       NaN    15.158730
std        NaN       NaN     6.695265
min        NaN       NaN     3.333333
25%        NaN       NaN    11.944444
50%        NaN       NaN    17.222222
75%        NaN       NaN    19.722222
max        NaN       NaN    22.222222

In [14]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
your comments here:


We have numerical(float64) and categorical(object) data.

"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [64]:
# your code here

employees = pd.read_csv('/Users/gracemartinez/ironhack/Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [28]:
# your code here

employees.head(100)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [29]:
employees.describe(include= 'all')

         Name Department Education Gender    Title     Years     Salary
count       9          9         9      9        9  9.000000   9.000000
unique      9          3         3      2        3       NaN        NaN
top     David         IT    Master      M  analyst       NaN        NaN
freq        1          4         5      5        4       NaN        NaN
mean      NaN        NaN       NaN    NaN      NaN  4.111111  48.888889
std       NaN        NaN       NaN    NaN      NaN  2.803767  16.541194
min       NaN        NaN       NaN    NaN      NaN  1.000000  30.000000
25%       NaN        NaN       NaN    NaN      NaN  2.000000  35.000000
50%       NaN        NaN       NaN    NaN      NaN  3.000000  55.000000
75%       NaN        NaN       NaN    NaN      NaN  7.000000  60.000000
max       NaN        NaN       NaN    NaN      NaN  8.000000  70.000000

In [17]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here:


We have numerical(int64) and categorical(object) data.

"""

#### What's the average salary in this company?

In [18]:
# your code here

employees.mean()

Years      4.111111
Salary    48.888889
dtype: float64

In [21]:
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [26]:
# your code here

employees['Salary'].max()

70

#### What's the lowest salary?

In [30]:
# your code here

employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [37]:
# your code here

employees.loc[employees['Salary'] == 30]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [40]:
# your code here

employees.loc[2,:]

Name            David
Department         HR
Education      Master
Gender              M
Title         analyst
Years               2
Salary             30
Name: 2, dtype: object

#### Could you return only David's salary?

In [42]:
# your code here

employees.loc[2,'Salary']

30

#### Print all the rows where job title is associate.

In [43]:
# your code here

employees.loc[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [44]:
# Method 1
# your code here

employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [46]:
# Method 2
# your code here

employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [50]:
# your code here

employees.loc[(employees.Title == 'associate') & (employees.Salary > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [61]:
# your code here

employees.groupby(['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [75]:
# your code here

avg_sal = employees.groupby(['Title']).mean()
# del employees['Years']
#employees.drop(['Years'], axis=1)
avg_sal

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

In [76]:
del avg_sal['Years']
avg_sal

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

In [73]:
employees.groupby(['Title'])['Salary'].mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [67]:
# your code here

employees.quantile(0.25)

Years      2.0
Salary    35.0
Name: 0.25, dtype: float64

In [68]:
employees.quantile(0.75)

Years      7.0
Salary    60.0
Name: 0.75, dtype: float64

#### Is the mean salary different per gender?

In [69]:
# your code here

employees.groupby(['Gender']).mean()

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

In [ ]:
Yes, it is.

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [72]:
# your code here

employees.groupby(['Department']).describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [23]:
# your code here

orders = pd.read_csv('/Users/gracemartinez/ironhack/Orders.csv')

In [24]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [25]:
# your code here

orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here